app/controllers/gossips_page_controller.rb

SELECT "users".* FROM "users"
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "En colère"], ["content", "Caroline en a marre des ressources"], ["user_id", 1], ["created_at", "2023-05-11 10:44:50.486657"], ["updated_at", "2023-05-11 10:44:50.486657"]]
---
    def create
        @gossip = Gossip.new('user_id' => User.all.sample.id,
                        'title' => params[:title],
                        'content' => params[:content])

        if @gossip.save #si ça marche, il redirige vers la page index du site